{
  "values" : [["双重支付" ,"Double Spend" ,"俗称“双花”，指恶意用户试图将同一笔比特币同时支付给两个不同的收款人。"] ,
    ["区块链" ,"Blockchain" ,"一个公开的，包括所有已发送的交易列表，具体由一个一个区块相连而成，每一个区块都包含前一个区块的哈希值，还未被确认的交易以及一个nonce随机数。"] ,
    ["nonce随机数" ,"Random Nonce" ,"矿工挖矿生成一个新区快的的过程就是借助大量的算力，一个接着一个尝试所有随机数，直到某一个合适的nonce出现，使得这个区块的哈希值低于某一个阈值。"] ,
    ["比特币网络" ,"Bitcoin network" ,"比特币交易信息广播到的，所有共同维护区块链的电脑所连在一起形成的网络。某种意义上，可用于指代矿工。"] ,
    ["区块" ,"Block" ,"相当于一个账簿，记录一段时间内的交易信息。"] ,
    ["创世块" ,"The Genesis Block" ,"2009年1月4日（北京时间），由“中本聪”本人创建的第一个区块。"] ,
    ["地址" ,"Address" ,"一串字符串，只有知道了这个地址才能向他人发送比特币。"] ,
    ["交易" ,"Transaction" ,"是一条发送到全网络的消息通知，其中内容为哪些地址的比特币所有权转移到了哪些地址，从而使得接受者能够花掉收到的比特币，而阻止发送者再次使用已发送的比特币。"] ,
    ["矿池" ,"Mining Pool" ,"作为一种服务存在，使得矿工能够一起工作创建区块并平分利润。"] ,
    ["矿工" ,"Miner" ,"尝试创建区块并添加到区块链上的人或者机器。矿工每成功创建一个有效区块，即可获得比特币协议自动分发的一定数量比特币作为奖赏，后期随着比特币数量的饱和，该奖赏数量会降低。当流动中的比特币数量达到2100万个，将不再自动分发新的比特币给矿工，矿工的收入来源将主要靠处理交易过程中的小费收入。"] ,
    ["难度" ,"Difficulty" ,"矿工挖矿创建一个新的区块需要进行大量的数学运算，去逐一试出一个可以使得区块Hash值低于某一个阈值的nonce随机数，当这个阈值设定越低，其难度系数也就相应越高。该数字自动调节，以保证全网平均10分钟能找一个新的有效区块来处理这段时间内的交易。"] ,
    ["51%攻击" ,"51% Attack" ,"是指获得并使用足够强大的计算力，即超过比特币网络其他算力之和（起码控制51%的全网算力）后，尝试去获得阻拦逆转比特币交易的力量。"] ,
    ["确认" ,"Confirmation" ,"表示交易已被广播并验证打包，不会回滚。确认数越多回滚风险就越低，一般意义上，一个确认就已经相当安全，为可靠，可等待多次确认，即等到确认该交易的区块之后又再生成链上几个新的区块。"] ,
    ["未确认交易" ,"unconfirmed Transaction" ,"是还未打包到区块里面的交易。"] ,
    ["比特币客户端" ,"Bitcoin Client" ,"用来进行比特币发送与接收的软件，如标准比特币客户端Bitcoin-Qt"] ,
    ["钱包" ,"Wallet" ,"可以使比特币客户端的同义词，也可以指代一个文件，其中包含所有者的比特币地址及要使用这些地址所对应的私钥。"] ,
    ["哈希率" ,"Hash Rate" ,"用来衡量比特币网络的处理能力（进行高强度的数学运算），网络哈希率若达到10TH/s，就意味着这个网络每秒能处理10亿次计算。"] ,
    ["哈希值" ,"Hash" ,"又称散列，是一种函数。它能将任何数字字符串的输入转换成一个长度固定的输出。通过输出，除非我们试遍所有可能的输入，不然不可能反向推得输入，这也就确保了安全性。"] ,
    ["加密算法" ,"Encryption algorithm" ,"是一个函数，通过使用加密钥匙，把一条信息转化为一串不可阅读、看似随机的字符串，不具有可逆性，即无法倒推获得原始信息，除非是知道该密钥。加密使得私密信息通过因特网传输时，不会让第三方知道传输内容。"] ,
    ["公钥" ,"Public Key Cryptography" ,"每一个私钥都有一个相对应的公钥，从公钥无法推出私钥。任何数据一旦被公钥、私钥中的一种加密处理，可以用相对应的密钥进行解密。这就使得公布公钥后，所有人都可以发送加密信息过来，而不需要事先交换密钥。"] ,
    ["私钥" ,"Private Key" ,"私钥是与一个地址相关联的一把密钥，使得你可以动用之前转移到这个地址的比特币。"] ,
    ["数字签名" ,"Digital Signature" ,"通过附着在一条消息之后，用于证明这条消息的发送者就是和某个公钥相对应的私钥所有人，同时可以保证私钥的私密性。"] ,
    ["兑换所" ,"Exchange" ,"作为一种服务，允许人们相互买卖比特币，譬如Mt.Gox等。"] ,
    ["卖出价" ,"Ask price" ,"在某个兑换所中，人们愿意卖出比特币的最低价。"] ,
    ["买入价" ,"Bid price" ,"在某个兑换所中，人们愿意买入比特币的最高价。"] ,
    ["买卖价差" ,"Ask-bid Spread" ,"是上述两个价格相减所得差额的绝对值。"] ,
    ["交易所兑换量" ,"Volume of An Exchange" ,"在一定时间内，某交易所交易的比特币数量。"] ,
    ["市场深度" ,"Market depth" ,"在某个兑换所中，给定一段时间内，待售但还未售出的比特币数量。"] ,
    ["投机者" ,"Speculator" ,"指尝试低价买入比特币高价卖出比特币的那些人。比特币作为可交易的数字货币，同样会有价格的波动，通过不同兑换所之间的价格差来获取收益的行为称之为Arbitrage套利，而高频交易是指通过非常短期的价格波动预测来实行低买高卖策略的获利行为。"] ,
    ["泡沫" ,"Bubble" ,"类似目前的房地产市场，人们看涨比特币的价格走势，并买入比特币，导致比特币的价格上升，并持续这样的循环，直到泡沫破灭价格暴跌。迄今为止，第一次泡沫是2011年4月到6月之间，比特币的价格从0.75美元飙升至30美元，随后暴跌至2美元。之后2013年12月创下一次历史性新高，"] ,
    ["工作证明" ,"Proof of Work" ,"即工作量的证明。比特币在区块生成过程中使用了POW机制，最后通过是否率先找到合适的nonce随机数来决定是否获得奖励。"] ,
    ["挖矿" ,"Mining" ,"挖矿是不断生成新的区块，并将其链入到区块链的过程，更是比特币的发动机，没有挖矿就没有比特币。三个重要的功能为：1. 在没有到达规定总量之前，每一次挖矿都会发行新的比特币。2. 比特币交易需要得到记账认证，这样才能实现支付流转。 3. 区块的生成是算力的竞争，要想改写之前的记录就要有能力生成新的区块，这需要强大算力的支撑，也就是所谓51% Attack。但比特币网络遍布世界各地，想要拥有至少51%的算力是不大可能的事情。另外，之前的交易信息在比特币网络各处都有备份，这也就意味着，一次改写要经过众人耳目。"] ,
    ["主链分叉" ,"Blockchain Fork" ,"挖矿过程中，同一时刻可能会出现两个甚至多个合理满足要求的区块生成，区块链是树形的，允许分叉。遇到分叉时，会根据下列原则选择最优的：1. 分支高度不同，总是接受最高的那条分支。2. 相同高度的，认可难度最大的。 3. 都一致的话，就接受时间最早的。 4. 若上述均相同，则按照网络接受顺序择优。 5.当下一次链入区块时，根据同样原理重新选择最优的链。"] ,
    ["币天" ,"Coin Days Destroyed" ,"是对比特币现存总量的计算，并对比特币价格的走势有一定的指导意义。其定义为接受数量和滞留天数的乘积。币天既反映交易的活跃度，又反映沉睡比特币的唤醒量。币天平均消耗大，表示唤醒量的增多，与股票市场成交量不同，并不会因为左手卖出右手买进而使交易量上升，这种情况下币天并不改变。我们认为币天的下降，意味着市场中弱手的消失。"] ]
}